Repository: moussaart/Abdayex-paltform
Catalog: lib/l10n/intl_*.arb
Languages: ar, fr

# appName
source: ABDAYEX
ar: إبداعيكس

source: Home
ar: الصفحة الرئيسية
fr: Accueil

# Pr_title
source: Welcome to ABDAYEX platform
ar: منصة ابداعيكس التعليمية
fr: Bienvenue sur la plateforme ABDAYEX

# Pr_line_1
source: Welcome to the fascinating world of knowledge! We are here to provide you with a leading educational platform that combines fun and learning. Teachers can enhance their teaching methods by sharing their experiences and creativity. Meanwhile, students can enjoy engaging lessons and exciting educational games, helping them acquire knowledge inside and outside the school walls.
ar: مرحبًا في عالم المعرفة الرائع! نحن هنا لنقدم لك منصة تعليمية رائدة تجمع بين المرح والتعلم. تتيح للمعلمين تحسين طرق التدريس الخاصة بهم من خلال مشاركة خبراتهم وإبداعاتهم. بينما يمكن للتلاميذ الاستمتاع بدروس شيقة وألعاب تعليمية مثيرة، تساعدهم على اكتساب المعرفة داخل وخارج أروقة المدرسة.
fr: Bienvenue dans le monde fascinant du savoir ! Nous sommes là pour vous offrir une plateforme éducative de premier plan qui allie plaisir et apprentissage. Les enseignants peuvent améliorer leurs méthodes d'enseignement en partageant leurs expériences et leur créativité. Pendant ce temps, les étudiants peuvent profiter de leçons captivantes et de jeux éducatifs passionnants, les aidant à acquérir des connaissances à l'intérieur et à l'extérieur des murs de l'école.

# Pr_line_2
source: We open the doors to knowledge in an enjoyable and engaging manner, offering unique learning experiences that foster understanding and stimulate exploration. Whether you are a student looking for additional motivation or a teacher seeking to improve your skills, we provide modern and effective tools to maximize the learning process.
ar: تفتح أبواب المعرفة بأسلوب ممتع وجذاب، حيث تُقدم تجارب تعلم فريدة تنمي الفهم وتحفّز الاستكشاف. سواء كنت طالبًا يبحث عن تحفيز إضافي أو معلمًا يسعى لتحسين مهاراته، فإننا نقدم أدوات حديثة وفعّالة لتحقيق أقصى استفادة من عملية التعلم.
fr: Nous ouvrons les portes du savoir de manière agréable et engageante, offrant des expériences d'apprentissage uniques qui favorisent la compréhension et stimulent l'exploration. Que vous soyez un étudiant en quête de motivation supplémentaire ou un enseignant cherchant à améliorer vos compétences, nous fournissons des outils modernes et efficaces pour maximiser le processus d'apprentissage.

# Pr_line_3
source: Join us on a journey of knowledge and creativity, where education meets entertainment and results in unforgettable learning experiences. With our platform, there are no limits to knowledge and fun.
ar: انضم إلينا في رحلة المعرفة والإبداع، حيث يلتقي التعليم بالتسلية، ويتمخض عن تجارب تعلم لا تُنسى. مع منصتنا، لا حدود للمعرفة والمرح
fr: Rejoignez-nous dans un voyage de connaissance et de créativité, où l'éducation rencontre le divertissement et donne lieu à des expériences d'apprentissage inoubliables. Avec notre plateforme, il n'y a pas de limites au savoir et au plaisir.

# Solution_title
source: Our Services
ar: خــدًمـاتنــا
fr: Nos Services

# Solution_Prestation
source: Our services aim to make the learning journey enjoyable and effective through a diverse range of offerings.
ar: خدماتنا تهدف إلى جعل رحلة التعلم ممتعة وفعّالة، وذلك من خلال مجموعة من الخدمات المتنوعة
fr: Nos services visent à rendre le parcours d'apprentissage agréable et efficace grâce à une gamme variée d'offres.

# Solution_item_1
source: Distinctive Lessons and Exercises
ar: دروس وتمارين متميزة
fr: Leçons et Exercices Distinctifs

# Solution_line_1
source: We offer outstanding lessons and exercises prepared by experienced teachers to ensure comprehensive understanding and deep absorption of educational materials.
ar: .نقدم دروسًا وتمارينًا متميزة، من إعداد معلمين ذوي خبرة، لضمان فهم شامل واستيعاب عميق للمواد التعليمية
fr: Nous proposons des leçons exceptionnelles et des exercices préparés par des enseignants expérimentés pour assurer une compréhension complète et une absorption profonde des matériels éducatifs.

# Solution_item_2
source: Interactive Educational Content
ar: محتوى تعليمي تفاعلي
fr: Contenu Éducatif Interactif

# Solution_line_2
source: We provide interactive educational content that promotes learning experiences and encourages active student participation.
ar: .نقدم محتوى تعليمي يتيح التفاعل والمشاركة، مما يعزز تجربة التعلم ويشجع على المشاركة الفعّالة من قبل الطلاب
fr: Nous fournissons du contenu éducatif interactif qui favorise les expériences d'apprentissage et encourage la participation active des étudiants.

# Solution_item_3
source: Inspiring Educational Experience
ar: تجربة تعليمية ملهمة
fr: Expérience Éducative Inspirante

# Solution_line_3
source: We strive to deliver an inspiring and motivating educational experience, where students feel enthusiasm and curiosity to continue their journey in the world of knowledge.
ar: .نسعى لإيصال تجربة تعليمية ملهمة ومحفزة، حيث يشعر الطلاب بالحماس والفضول لمواصلة رحلتهم في عالم المعرفة.
fr: Nous nous efforçons de fournir une expérience éducative inspirante et motivante, où les étudiants ressentent enthousiasme et curiosité pour poursuivre leur parcours dans le monde du savoir.

# Solution_item_4
source: Periodic Educational Content
ar: محتوى تعليمي دوري
fr: Contenu Éducatif Périodique

# Solution_line_4
source: We offer diverse educational content covering curricula, helping students enhance their skills and knowledge in various fields.
ar: .نقدم محتوى تعليمي متنوع يغطي المناهج الدراسية، مما يساعد الطلاب في تعزيز مهاراتهم ومعرفتهم في مختلف المجالات
fr: Nous proposons un contenu éducatif diversifié couvrant les programmes, aidant les étudiants à améliorer leurs compétences et connaissances dans divers domaines.

# Services_title
source: Our Solutions
ar: حـلـولـنـا
fr: Nos Solutions

# Services_Prestation
source: Our platform takes pride in offering advanced educational and training solutions that bring together technological innovation and modern creativity.
ar: تفخر منصتنا بتقديم حلول تعليمية وتدريبية متقدمة تجمع بين الابتكار التقني والإبداع الحديث
fr: Notre plateforme se distingue par la fourniture de solutions éducatives et de formation avancées alliant innovation technologique et créativité moderne.

# Services_line_1
source: We provide a comprehensive educational platform covering all subjects and academic stages, allowing students to access outstanding educational content anytime, anywhere.
ar: نقدم منصة تعليمية شاملة تغطي جميع المواد والمراحل الدراسية، حيث يمكن للطلاب الوصول إلى محتوى تعليمي متميز في أي وقت ومن أي مكان
fr: Nous proposons une plateforme éducative complète couvrant toutes les matières et les étapes académiques, permettant aux étudiants d'accéder à un contenu éducatif exceptionnel à tout moment et de n'importe où.

# Services_line_2
source: We employ machine learning and artificial intelligence techniques to deliver a customized and enhanced learning experience, helping students achieve their maximum potential.
ar: نستخدم تقنيات التعلم الآلي والذكاء الاصطناعي لتقديم تجربة تعلم مخصصة ومحسنة، مما يساعد الطلاب على تحقيق أقصى إمكانياتهم
fr: Nous utilisons des techniques d'apprentissage automatique et d'intelligence artificielle pour offrir une expérience d'apprentissage personnalisée et améliorée, aidant les étudiants à atteindre leur plein potentiel.

# Services_line_3
source: We offer advanced training solutions aimed at developing students' skills and motivating them to acquire deep knowledge in various fields.
ar: نقدم حلولًا تدريبية متقدمة تستهدف تطوير مهارات الطلاب وتحفيزهم لاكتساب معرفة عميقة في مجالات مختلفة
fr: Nous proposons des solutions de formation avancées visant à développer les compétences des étudiants et à les inciter à acquérir une connaissance approfondie dans divers domaines.

# Services_line_4
source: To encourage interaction and participation, we provide interactive and stimulating tools that enhance communication between teachers and students, contributing to building an effective learning environment.
ar: تشجيعًا على التفاعل والمشاركة، نقدم أدوات تفاعلية ومحفزة تعزز التواصل بين المعلمين والطلاب وتسهم في بناء بيئة تعلم فعّالة
fr: Pour encourager l'interaction et la participation, nous mettons à disposition des outils interactifs et stimulants qui renforcent la communication entre les enseignants et les étudiants, contribuant ainsi à la création d'un environnement d'apprentissage efficace.

# Services_item_1
source: Integrated Learning Platform
ar: منصة تعليم متكاملة
fr: Plateforme d'Apprentissage Intégrée

# Services_item_2
source: Smart Learning Technology
ar: تكنولوجيا التعلم الذكي
fr: Technologie d'Apprentissage Intelligent

# Services_item_3
source: Advanced Training Solutions
ar: حلول متقدمة للتدريب
fr: Solutions de Formation Avancées

# Services_item_4
source: Interaction and Participation
ar: تفاعل ومشاركة
fr: Interaction et Participation

source: Student Space
ar: فضاء التلميذ
fr: Espace Étudiant

source: Class
ar: الدرجة
fr: Classe

source: All grades
ar: جميع الدرجات
fr: Toutes les classes

# firstGegree
source: First degree
ar: الدرجة الأولى
fr: Première classe

# SecondGegree
source: Second degree
ar: الدرجة الثانية
fr: Deuxième classe

# ThirdGegree
source: Third degree
ar: الدرجة الثالثة
fr: Troisième classe

source: Educational Level
ar: المستوى التعليمي
fr: Niveau éducatif

source: First Year Primary
ar: السنة الأولى ابتدائي
fr: Première année primaire

source: Second Year Primary
ar: السنة الثانية ابتدائي
fr: Deuxième année primaire

source: Third Year Primary
ar: السنة الثالثة ابتدائي
fr: Troisième année primaire

source: Fourth Year Primary
ar: السنة الرابعة ابتدائي
fr: Quatrième année primaire

source: Fifth Year Primary
ar: السنة الخامسة ابتدائي
fr: Cinquième année primaire

source: Sixth Year Primary
ar: السنة السادسة ابتدائي
fr: Sixième année primaire

source: Content
ar: محتوى
fr: Contenu

# Searchthedatabase
source: Search in the database
ar: بحث في قاعدة البيانات
fr: Rechercher dans la base de données

source: Teacher Space
ar: فضاء المعلم
fr: Espace Enseignant

source: login
ar: تسجيل الدخول
fr: Connexion

source: Email
ar: البريد الإلكتروني

source: password
ar: كلمة المرور
fr: Mot de passe

source: forgot password
ar: نسيت كلمة المرور
fr: Mot de passe oublié

# DHA
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

source: registration
ar: التسجيل
fr: Inscription

source: Google
ar: جوجل

source: Sign up
ar: التسجيل
fr: Inscription

# createAccount
source: Create your account
ar: إنشاء حسابك
fr: Créer votre compte

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Confirm password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

# alreadyHaveAccount
source: Already have an account ?
ar: هل لديك حساب بالفعل؟
fr: Déjà un compte ?

source: Contact Information
ar: معلومات الاتصال
fr: Coordonnées

source: Useful Links
ar: روابط مفيدة
fr: Liens Utiles

# humanitiesInstitute
source: Institute of Humanities in Gafsa
ar: معهد العلوم الإنسانية بقفصة
fr: Institut des Sciences Humaines à Gafsa

# higherEducationMinistry
source: Ministry of Higher Education and Scientific Research
ar: وزارة التعليم العالي والبحث العلمي
fr: Ministère de l'Enseignement Supérieur et de la Recherche Scientifique

# educationMinistry
source: Ministry of Education
ar: وزارة التربية والتعليم
fr: Ministère de l'Éducation

source: Developed By
ar: طورت بواسطة
fr: Développé par

# pages
source: Our Pages
ar: صفحاتنا
fr: Nos Pages

# links
source: Our Links
ar: صفحاتنا
fr: Nos Liens

# emailError
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح
fr: Veuillez saisir une adresse e-mail valide

# emptyPasswordError
source: Password cannot be empty
ar: لا يمكن ترك حقل كلمة المرور فارغًا
fr: Le mot de passe ne peut pas être vide

# shortPasswordError
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور على الأقل 8 أحرف
fr: Le mot de passe doit comporter au moins 8 caractères

# uppercaseLetterError
source: Password must contain at least one uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل
fr: Le mot de passe doit contenir au moins une lettre majuscule

# numberInPasswordError
source: Password must contain at least one number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل
fr: Le mot de passe doit contenir au moins un chiffre

# passwordsNotMatchError
source: Passwords do not match
ar: كلمات المرور غير متطابقة
fr: Les mots de passe ne correspondent pas

# nameLengthError
source: Name should be at least 2 characters
ar: يجب أن يتألف الاسم من ما لا يقل عن حرفين
fr: Le nom doit comporter au moins 2 caractères

source: Please wait
ar: الرجاء الانتظار
fr: Veuillez patienter

# errorMessageSignIn
source: The email or password is incorrect, please check
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة، يرجى التحقق
fr: L'adresse e-mail ou le mot de passe est incorrect, veuillez vérifier

# errorMessageSignUp
source: The Email Address is already in use by another account
ar: عنوان البريد الإلكتروني مستخدم بالفعل من قبل حساب آخر
fr: L'adresse e-mail est déjà utilisée par un autre compte

source: All years
fr: Toutes les années

# address
source: P.O. Box 743 - 2078 La Marsa, Tunis
fr: B.P. 743 - 2078 La Marsa, Tunis
